
def solve():
    st = 'くさこお{たふふたぬしいやむかひめぬかやしいさふしめひわやいかぬらかるめいらふむに}'

    mapping = {
        "お": "1",
        "こ": "2",
        "か": "a",
        "く": "c",
        "さ": "d",
        "し": "e",
        "た": "g",
        "に": "k",
        "ぬ": "l",
        "ひ": "n",
        "ふ": "o",
        "む": "r",
        "め": "s",
        "や": "t",
        "ら": "w",
        "る": "y",
        "わ": "'",
        "い": "-",
        "{": "{",
        "}": "}",
    }

    flag = ''
    for ch in st:
        flag += mapping[ch]
    return flag


if __name__ == "__main__":
    print(solve())
